Revit 2027 API
AssetProperties.Get Method
 Gets the property at the given index.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AssetProperty Get(
	int index
)
Public Function Get (
	index As Integer
) As AssetProperty
public:
AssetProperty^ Get(
	int index
)
member Get :
        index : int -> AssetProperty
Parameters
index Int32
 An integer index.
Return Value
AssetProperty
 The property at the given index.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
See Also
Reference
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace